data/cfdb/verification/channel_poiseuille/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// Transient to steady: viscous time H^2/nu = 2 s, flow-through L/U0 = 1.2 s,
// so endTime = 5 s gives > 2 viscous times for the profile to develop.
endTime         5.0;

// Co = u_max*dt/dx = 0.15*1e-3/5e-4 = 0.3
deltaT          0.001;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    probes
    {
        type            probes;
        libs            (fieldFunctionObjects);

        writeControl    timeStep;
        writeInterval   1;

        // Vertical probe line at x/H = 10 (x = 0.1 m), downstream of the
        // laminar entrance length (L_e/Dh ~ 0.05*Re_Dh = 2 -> L_e ~ 4H).
        // Points sit at the 20 cell centres across the channel.
        probeLocations
        (
            (0.1 0.00025 0.0005)
            (0.1 0.00075 0.0005)
            (0.1 0.00125 0.0005)
            (0.1 0.00175 0.0005)
            (0.1 0.00225 0.0005)
            (0.1 0.00275 0.0005)
            (0.1 0.00325 0.0005)
            (0.1 0.00375 0.0005)
            (0.1 0.00425 0.0005)
            (0.1 0.00475 0.0005)
            (0.1 0.00525 0.0005)
            (0.1 0.00575 0.0005)
            (0.1 0.00625 0.0005)
            (0.1 0.00675 0.0005)
            (0.1 0.00725 0.0005)
            (0.1 0.00775 0.0005)
            (0.1 0.00825 0.0005)
            (0.1 0.00875 0.0005)
            (0.1 0.00925 0.0005)
            (0.1 0.00975 0.0005)
        );

        fields          ( U );
    }
}

// ************************************************************************* //
